In [1]:
import pandas as pd
import numpy  as np
df = pd.DataFrame([\
                   ['frank', 'M',    np.nan], \
                   ['mary' , np.nan, np.nan], \
                   ['tom'  , 'M',    35], \
                   ['ted'  , 'M',    33], \
                   ['jean' , np.nan, 21], \
                   ['lisa' , 'F',    20]])
df.columns = ['name', 'gender', 'age']
df

    name gender   age
0  frank      M   NaN
1   mary    NaN   NaN
2    tom      M  35.0
3    ted      M  33.0
4   jean    NaN  21.0
5   lisa      F  20.0

In [2]:
df['gender'].notnull()

0     True
1    False
2     True
3     True
4    False
5     True
Name: gender, dtype: bool

In [3]:
df['age'].isnull().values.any()

True

In [4]:
df.isnull().values.any()

True

In [6]:
df.isnull().any()

name      False
gender     True
age        True
dtype: bool

In [7]:
df['age'].isnull().sum()

2

In [8]:
df.isnull().sum()

name      0
gender    2
age       2
dtype: int64

In [9]:
df.isnull().sum().sum()

4